cases/00-tutorials/Plate2D-mhd-postpatch/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Interface tracking method: isoAdvector or MULES
interfaceTrackingScheme isoAdvector;

electromagnetics true;

phases          (metal gas);

metal
{
    transportModel      Newtonian;
    nu                  5e-07;
    rho                 8000;
	Tsolidus            1658;
	Tliquidus           1723;
    LatentHeat          2.7e5;
    beta                5.0e-6;
    poly_kappa          (25 0.0 0 0 0 0 0 0);
    poly_cp             (700 0.0 0 0 0 0 0 0);
    // elec_resistivity	1.0e-6; //deprecated - reading in conductivity
    Elec_conductivity	1.0e6;
    Mag_permitivity	1.256e-6;
}

gas
{
    transportModel      Newtonian;
    nu                  0.5e-05;
    rho                 1.78;
    Tsolidus            1.0;
    Tliquidus           10.0;
    LatentHeat          1;
    beta                4.0e-5;
    poly_kappa          (0.4 0.0 0 0 0 0 0 0);
    poly_cp             (520 0.0 0 0 0 0 0 0);
    Elec_conductivity	1.0;
    Mag_permitivity	1.256e-6;
}

sigma                   1.2;
Marangoni_Constant      -5e-4;
p0	                    1e5;
Tvap	                3500;
Mm	                    0.05;
LatentHeatVap	        6e5;
emS                     0.4;
emL                     0.1;
TRef                    TRef [0 0 0 1 0 0 0]   300;
// ************************************************************************* //
